{
  "jobs": [
    {
      "start_date": "2019-09-09T19:45:35.052Z",
      "end_date": "",
      "company": "Monzo Bank",
      "role": "Backend Software Engineer",
      "description": "Working in customer operations, helping to build our internal customer relationship management platform and scale  in-app chat, calls and email to over 4 million customers.",
      "key_points": [
        "Saved >£10M per year, as the lead backend engineer on multiple customer operations cost saving projects",
        "Reduced calls inbound by >20% by rebuilding our core interactive voice response system",
        "Resolved complex issues as an operations on-call engineer, making use of Grafana, Kibana, Jaeger",
        "Onboarded and upskilled new engineers, supporting them in learning Golang and other core competencies",
        "Built internal microservice directory, which improved developer experience"
      ]
    },
    {
      "start_date": "2018-07-09T19:47:20.870Z",
      "end_date": "2020-08-07T19:47:20.891Z",
      "company": "Goldman Sachs",
      "role": "Backend Engineer (Analyst)",
      "description": "Building an investment banking equities platform that facilitates multi billion dollar IPOs, including Uber and Slack.",
      "key_points": [
        "Worked on converting our monolith equities management application into a suite of RESTful Java Spring microservices",
        "On-call engineer for the Uber IPO, ensuring that any production incidents were resolved quickly and efficiently"
      ]
    }
  ],
  "name": "Aran Long",
  "biography": "Hi! I’m a software engineer motivated by solving product problems with technology. I’m seeking a senior role, where I can help you build products that will be loved by many",
  "skills": [
    {
      "skill": "Golang"
    },
    {
      "skill": "Python"
    },
    {
      "skill": "Python"
    },
    {
      "skill": "Javascript"
    },
    {
      "skill": "React"
    }
  ],
  "contactInfo": [
    {
      "contact": "https://aran.site",
      "link": "https://aran.site"
    },
    {
      "contact": "me@aran.site",
      "link": "mailto:me@aran.site"
    },
    {
      "contact": "+44 7933 282564",
      "link": "tel:+44 7933 282564"
    }
  ],
  "projects": [
    {
      "name": "Pedalo",
      "description": "Ethereum blockchain based credential verification system, awarded the “best use of blockchain” at the largest hackathon in Canada, received pre-seed grant from 1517fund - based in Silicon Valley."
    },
    {
      "name": "Notifi.Click",
      "description": "Zero-cost paging system building using a serverless architecture and Amazon dash buttons. Awarded the best use of Amazon Web Services at HackUPC in Barcelona."
    }
  ]
}